app/views/assignments/show.html.erb


<% @assignment.results.each do |result| %>
---
SELECT "results".* FROM "results" WHERE "results"."assignment_id" = ?  [["assignment_id", 1]]