app/views/searches/show.html.erb

SELECT  1 AS one FROM "results" WHERE (student_name LIKE '%#(keywords)%') AND (min_result >= 40) AND (max_result <= 100) AND (comment LIKE '%(comment)%') LIMIT ?  [["LIMIT", 1]]
SELECT "results".* FROM "results" WHERE (result_percentage >= 40) AND (result_percentage <= 100)
---

<% if @search.search_results.empty? %>