app/views/courses/_form.html.erb

    <%= f.input :duration %>
    <%= f.association :profile, label_method: :lastname, :collection => Profile.where(:role => "Lecturer") %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."role" = ?  [["role", "Lecturer"]]