app/views/courses/show.html.erb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."course_id" = ?  [["course_id", 1]]
---

<% @course.assignments.each do |assignment| %>