app/controllers/assignments_controller.rb

  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save
---
INSERT INTO "assignments" ("name", "due_date", "worth", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "CA1"], ["due_date", "2019-03-29 19:29:00"], ["worth", "50%"], ["course_id", 1], ["created_at", "2019-03-29 19:29:29.566090"], ["updated_at", "2019-03-29 19:29:29.566090"]]

  def destroy
    @assignment.destroy
---
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 2]]