app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("title", "description", "course_type", "duration", "profile_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)