app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)


    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("firstname", "lastname", "address", "user_id", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?, ?)

  def signedinuserprofile profile =
    Profile.find_by_user_id(current_user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]