app/controllers/results_controller.rb

  def index
    @results = Result.search(params[:search])
---
SELECT "results".* FROM "results" WHERE (student_name LIKE '%may%')

  def create
    @result = Result.new(result_params)

    respond_to do |format|
      if @result.save
---
INSERT INTO "results" ("student_name", "result_percentage", "comment", "assignment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_result
      @result = Result.find(params[:id])
---
SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]