app/controllers/searches_controller.rb

INSERT INTO "searches" ("keywords", "result_min", "result_max", "comment", "assignment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["keywords", "May"], ["result_min", 40], ["result_max", 70], ["comment", "Good"], ["assignment", "CA1"], ["created_at", "2019-03-31 10:03:36.299951"], ["updated_at", "2019-03-31 10:03:36.299951"]]
---
    def create
        @search = Search.create(search_params)